# Terraform environment test
#### Format and Style 🖌`success`
#### Initialization ⚙️`success`
#### Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Plan 📖`success`

<details><summary>Show Plan</summary>

```

[Lines containing Refreshing state removed]
[Truncated to 120000 bytes! See logoutput for complete plan]
Acquiring state lock. This may take a few moments...
data.azurerm_resource_group.rg_studio_dev: Reading...
data.azurerm_resource_group.rg_studio_law_test: Reading...
data.azurerm_resource_group.rg_studio_stag: Reading...
data.azurerm_resource_group.rg_studio_dev: Read complete after 1s [id=/subscriptions/971ddbb1-27d0-4cc7-a016-461dab5cec05/resourceGroups/studio-dev-rg]
data.azurerm_resource_group.rg_studio_law_test: Read complete after 1s [id=/subscriptions/971ddbb1-27d0-4cc7-a016-461dab5cec05/resourceGroups/altinn-rg]
data.azurerm_log_analytics_workspace.studio_law_test: Reading...
data.azurerm_resource_group.rg_studio_stag: Read complete after 1s [id=/subscriptions/971ddbb1-27d0-4cc7-a016-461dab5cec05/resourceGroups/studio-staging-rg]
data.azurerm_resource_group.rg_studio_prod: Reading...
data.azurerm_resource_group.rg_studio_law_prod: Reading...
data.azurerm_resource_group.rg_studio_prod: Read complete after 1s [id=/subscriptions/f66298ed-870c-40e0-bb74-6db89c1a364b/resourceGroups/studio-prod-rg]
data.azurerm_resource_group.rg_studio_law_prod: Read complete after 1s [id=/subscriptions/f66298ed-870c-40e0-bb74-6db89c1a364b/resourceGroups/altinn-rg]
data.azurerm_log_analytics_workspace.studio_law_prod: Reading...
data.azurerm_client_config.current: Reading...
data.azurerm_monitor_data_collection_rule.prometheus: Reading...
data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD1mMDNmNzU3OS01ZjM5LTRkN2YtYmNlYS04ZTVjYjZkN2FjYTQ7b2JqZWN0SWQ9MDJiMTdkMjgtN2VjOC00MDg0LTkyY2UtZDI2MDUxZmE0OTk4O3N1YnNjcmlwdGlvbklkPTFjZThlOWFmLWMyZDYtNDRlNy05YzVlLTA5OWEzMDgwNTZmZTt0ZW5hbnRJZD1jZDAwMjZkOC0yODNiLTRhNTUtOWJmYS1kMGVmNGE4YmEyMWM=]
data.azurerm_log_analytics_workspace.studio_law_test: Read complete after 1s [id=/subscriptions/971ddbb1-27d0-4cc7-a016-461dab5cec05/resourceGroups/altinn-rg/providers/Microsoft.OperationalInsights/workspaces/altinn-studio-test-log]
data.azurerm_resource_group.rg_dp_stag: Reading...
data.azurerm_log_analytics_workspace.studio_law_prod: Read complete after 1s [id=/subscriptions/f66298ed-870c-40e0-bb74-6db89c1a364b/resourceGroups/altinn-rg/providers/Microsoft.OperationalInsights/workspaces/altinn-studio-prod-log]
data.azurerm_monitor_data_collection_rule.prometheus: Read complete after 1s [id=/subscriptions/1ce8e9af-c2d6-44e7-9c5e-099a308056fe/resourceGroups/MA_k6tests-amw_norwayeast_managed/providers/Microsoft.Insights/dataCollectionRules/k6tests-amw]
data.azurerm_log_analytics_workspace.dp_law_test["dp-be-yt01-insightsWorkspace"]: Reading...
data.azurerm_resource_group.rd_dp_test["dp-be-test-rg"]: Reading...
data.azurerm_log_analytics_workspace.dp_law_test["dp-be-test-insightsWorkspace"]: Reading...
data.azurerm_resource_group.rg_dp_stag: Read complete after 1s [id=/subscriptions/e4926efc-0577-47b3-9c3d-757925630eca/resourceGroups/dp-be-staging-rg]
data.azurerm_resource_group.rd_dp_test["dp-be-yt01-rg"]: Reading...
data.azurerm_log_analytics_workspace.dp_law_stag: Reading...
data.azurerm_resource_group.rd_dp_test["dp-be-test-rg"]: Read complete after 0s [id=/subscriptions/8a353de8-d81d-468d-a40d-f3574b6bb3f4/resourceGroups/dp-be-test-rg]
data.azurerm_resource_group.rd_dp_test["dp-be-yt01-rg"]: Read complete after 1s [id=/subscriptions/8a353de8-d81d-468d-a40d-f3574b6bb3f4/resourceGroups/dp-be-yt01-rg]
data.azurerm_log_analytics_workspace.dp_law_test["dp-be-yt01-insightsWorkspace"]: Read complete after 1s [id=/subscriptions/8a353de8-d81d-468d-a40d-f3574b6bb3f4/resourceGroups/dp-be-yt01-rg/providers/Microsoft.OperationalInsights/workspaces/dp-be-yt01-insightsWorkspace]
data.azurerm_resource_group.rg_dp_prod: Reading...
data.azurerm_log_analytics_workspace.dp_law_test["dp-be-test-insightsWorkspace"]: Read complete after 1s [id=/subscriptions/8a353de8-d81d-468d-a40d-f3574b6bb3f4/resourceGroups/dp-be-test-rg/providers/Microsoft.OperationalInsights/workspaces/dp-be-test-insightsWorkspace]
data.azurerm_log_analytics_workspace.dp_law_stag: Read complete after 2s [id=/subscriptions/e4926efc-0577-47b3-9c3d-757925630eca/resourceGroups/dp-be-staging-rg/providers/Microsoft.OperationalInsights/workspaces/dp-be-staging-insightsWorkspace]
data.azurerm_resource_group.rg_dp_prod: Read complete after 1s [id=/subscriptions/c595f787-450d-4c57-84fa-abc5f95d5459/resourceGroups/dp-be-prod-rg]
data.azurerm_log_analytics_workspace.dp_law_prod: Reading...
data.azurerm_log_analytics_workspace.dp_law_prod: Read complete after 1s [id=/subscriptions/c595f787-450d-4c57-84fa-abc5f95d5459/resourceGroups/dp-be-prod-rg/providers/Microsoft.OperationalInsights/workspaces/dp-be-prod-insightsWorkspace]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # azurerm_role_assignment.monitoring_reader_rg_dp_prod must be replaced
-/+ resource "azurerm_role_assignment" "monitoring_reader_rg_dp_prod" {
      + condition_version                      = (known after apply)
      ~ id                                     = "/subscriptions/c595f787-450d-4c57-84fa-abc5f95d5459/resourceGroups/dp-be-prod-rg/providers/Microsoft.Authorization/roleAssignments/7646d5a3-9674-396e-244f-ef4b785d939b" -> (known after apply)
      ~ name                                   = "7646d5a3-9674-396e-244f-ef4b785d939b" -> (known after apply)
      ~ principal_type                         = "ServicePrincipal" -> (known after apply)
      ~ role_definition_id                     = "/subscriptions/c595f787-450d-4c57-84fa-abc5f95d5459/providers/Microsoft.Authorization/roleDefinitions/43d0d8ad-25c7-4714-9337-8ba259a9fe05" -> "/subscriptions/1ce8e9af-c2d6-44e7-9c5e-099a308056fe/providers/Microsoft.Authorization/roleDefinitions/43d0d8ad-25c7-4714-9337-8ba259a9fe05" # forces replacement
      ~ role_definition_name                   = "Monitoring Reader" -> (known after apply)
        # (6 unchanged attributes hidden)
    }

  # azurerm_role_assignment.monitoring_reader_rg_dp_stag must be replaced
-/+ resource "azurerm_role_assignment" "monitoring_reader_rg_dp_stag" {
      + condition_version                      = (known after apply)
      ~ id                                     = "/subscriptions/e4926efc-0577-47b3-9c3d-757925630eca/resourceGroups/dp-be-staging-rg/providers/Microsoft.Authorization/roleAssignments/77d7fdd7-2857-f32f-0dcf-e82ffb346ef3" -> (known after apply)
      ~ name                                   = "77d7fdd7-2857-f32f-0dcf-e82ffb346ef3" -> (known after apply)
      ~ principal_type                         = "ServicePrincipal" -> (known after apply)
      ~ role_definition_id                     = "/subscriptions/e4926efc-0577-47b3-9c3d-757925630eca/providers/Microsoft.Authorization/roleDefinitions/43d0d8ad-25c7-4714-9337-8ba259a9fe05" -> "/subscriptions/1ce8e9af-c2d6-44e7-9c5e-099a308056fe/providers/Microsoft.Authorization/roleDefinitions/43d0d8ad-25c7-4714-9337-8ba259a9fe05" # forces replacement
      ~ role_definition_name                   = "Monitoring Reader" -> (known after apply)
        # (6 unchanged attributes hidden)
    }

  # azurerm_role_assignment.monitoring_reader_rg_dp_test["dp-be-test-rg"] must be replaced
-/+ resource "azurerm_role_assignment" "monitoring_reader_rg_dp_test" {
      + condition_version                      = (known after apply)
      ~ id                                     = "/subscriptions/8a353de8-d81d-468d-a40d-f3574b6bb3f4/resourceGroups/dp-be-test-rg/providers/Microsoft.Authorization/roleAssignments/a2ea4ab0-3158-1541-a6e1-c86e09425c93" -> (known after apply)
      ~ name                                   = "a2ea4ab0-3158-1541-a6e1-c86e09425c93" -> (known after apply)
      ~ principal_type                         = "ServicePrincipal" -> (known after apply)
      ~ role_definition_id                     = "/subscriptions/8a353de8-d81d-468d-a40d-f3574b6bb3f4/providers/Microsoft.Authorization/roleDefinitions/43d0d8ad-25c7-4714-9337-8ba259a9fe05" -> "/subscriptions/1ce8e9af-c2d6-44e7-9c5e-099a308056fe/providers/Microsoft.Authorization/roleDefinitions/43d0d8ad-25c7-4714-9337-8ba259a9fe05" # forces replacement
      ~ role_definition_name                   = "Monitoring Reader" -> (known after apply)
        # (6 unchanged attributes hidden)
    }

  # azurerm_role_assignment.monitoring_reader_rg_dp_test["dp-be-yt01-rg"] must be replaced
-/+ resource "azurerm_role_assignment" "monitoring_reader_rg_dp_test" {
      + condition_version                      = (known after apply)
      ~ id                                     = "/subscriptions/8a353de8-d81d-468d-a40d-f3574b6bb3f4/resourceGroups/dp-be-yt01-rg/providers/Microsoft.Authorization/roleAssignments/c0e5b116-757f-4231-c6bc-37c2ab169c12" -> (known after apply)
      ~ name                                   = "c0e5b116-757f-4231-c6bc-37c2ab169c12" -> (known after apply)
      ~ principal_type                         = "ServicePrincipal" -> (known after apply)
      ~ role_definition_id                     = "/subscriptions/8a353de8-d81d-468d-a40d-f3574b6bb3f4/providers/Microsoft.Authorization/roleDefinitions/43d0d8ad-25c7-4714-9337-8ba259a9fe05" -> "/subscriptions/1ce8e9af-c2d6-44e7-9c5e-099a308056fe/providers/Microsoft.Authorization/roleDefinitions/43d0d8ad-25c7-4714-9337-8ba259a9fe05" # forces replacement
      ~ role_definition_name                   = "Monitoring Reader" -> (known after apply)
        # (6 unchanged attributes hidden)
    }

  # azurerm_role_assignment.monitoring_reader_rg_studio_dev must be replaced
-/+ resource "azurerm_role_assignment" "monitoring_reader_rg_studio_dev" {
      + condition_version                      = (known after apply)
      ~ id                                     = "/subscriptions/971ddbb1-27d0-4cc7-a016-461dab5cec05/resourceGroups/studio-dev-rg/providers/Microsoft.Authorization/roleAssignments/f3b68a4f-ebce-7e7d-68ec-034b2e951705" -> (known after apply)
      ~ name                                   = "f3b68a4f-ebce-7e7d-68ec-034b2e951705" -> (known after apply)
      ~ principal_type                         = "ServicePrincipal" -> (known after apply)
      ~ role_definition_id                     = "/subscriptions/971ddbb1-27d0-4cc7-a016-461dab5cec05/providers/Microsoft.Authorization/roleDefinitions/43d0d8ad-25c7-4714-9337-8ba259a9fe05" -> "/subscriptions/1ce8e9af-c2d6-44e7-9c5e-099a308056fe/providers/Microsoft.Authorization/roleDefinitions/43d0d8ad-25c7-4714-9337-8ba259a9fe05" # forces replacement
      ~ role_definition_name                   = "Monitoring Reader" -> (known after apply)
        # (6 unchanged attributes hidden)
    }

  # azurerm_role_assignment.monitoring_reader_rg_studio_law_prod must be replaced
-/+ resource "azurerm_role_assignment" "monitoring_reader_rg_studio_law_prod" {
      + condition_version                      = (known after apply)
      ~ id                                     = "/subscriptions/f66298ed-870c-40e0-bb74-6db89c1a364b/resourceGroups/altinn-rg/providers/Microsoft.Authorization/roleAssignments/3c6333b8-e2a3-8b8f-b227-5a8ae1c19c51" -> (known after apply)
      ~ name                                   = "3c6333b8-e2a3-8b8f-b227-5a8ae1c19c51" -> (known after apply)
      ~ principal_type                         = "ServicePrincipal" -> (known after apply)
      ~ role_definition_id                     = "/subscriptions/f66298ed-870c-40e0-bb74-6db89c1a364b/providers/Microsoft.Authorization/roleDefinitions/43d0d8ad-25c7-4714-9337-8ba259a9fe05" -> "/subscriptions/1ce8e9af-c2d6-44e7-9c5e-099a308056fe/providers/Microsoft.Authorization/roleDefinitions/43d0d8ad-25c7-4714-9337-8ba259a9fe05" # forces replacement
      ~ role_definition_name                   = "Monitoring Reader" -> (known after apply)
        # (6 unchanged attributes hidden)
    }

  # azurerm_role_assignment.monitoring_reader_rg_studio_law_test must be replaced
-/+ resource "azurerm_role_assignment" "monitoring_reader_rg_studio_law_test" {
      + condition_version                      = (known after apply)
      ~ id                                     = "/subscriptions/971ddbb1-27d0-4cc7-a016-461dab5cec05/resourceGroups/altinn-rg/providers/Microsoft.Authorization/roleAssignments/4fa81b53-90e3-dbc6-e33c-3bc643a9e07c" -> (known after apply)
      ~ name                                   = "4fa81b53-90e3-dbc6-e33c-3bc643a9e07c" -> (known after apply)
      ~ principal_type                         = "ServicePrincipal" -> (known after apply)
      ~ role_definition_id                     = "/subscriptions/971ddbb1-27d0-4cc7-a016-461dab5cec05/providers/Microsoft.Authorization/roleDefinitions/43d0d8ad-25c7-4714-9337-8ba259a9fe05" -> "/subscriptions/1ce8e9af-c2d6-44e7-9c5e-099a308056fe/providers/Microsoft.Authorization/roleDefinitions/43d0d8ad-25c7-4714-9337-8ba259a9fe05" # forces replacement
      ~ role_definition_name                   = "Monitoring Reader" -> (known after apply)
        # (6 unchanged attributes hidden)
    }

  # azurerm_role_assignment.monitoring_reader_rg_studio_prod must be replaced
-/+ resource "azurerm_role_assignment" "monitoring_reader_rg_studio_prod" {
      + condition_version                      = (known after apply)
      ~ id                                     = "/subscriptions/f66298ed-870c-40e0-bb74-6db89c1a364b/resourceGroups/studio-prod-rg/providers/Microsoft.Authorization/roleAssignments/898f5de3-5060-7d18-131c-c36587be321d" -> (known after apply)
      ~ name                                   = "898f5de3-5060-7d18-131c-c36587be321d" -> (known after apply)
      ~ principal_type                         = "ServicePrincipal" -> (known after apply)
      ~ role_definition_id                     = "/subscriptions/f66298ed-870c-40e0-bb74-6db89c1a364b/providers/Microsoft.Authorization/roleDefinitions/43d0d8ad-25c7-4714-9337-8ba259a9fe05" -> "/subscriptions/1ce8e9af-c2d6-44e7-9c5e-099a308056fe/providers/Microsoft.Authorization/roleDefinitions/43d0d8ad-25c7-4714-9337-8ba259a9fe05" # forces replacement
      ~ role_definition_name                   = "Monitoring Reader" -> (known after apply)
        # (6 unchanged attributes hidden)
    }

  # azurerm_role_assignment.monitoring_reader_rg_studio_stag must be replaced
-/+ resource "azurerm_role_assignment" "monitoring_reader_rg_studio_stag" {
      + condition_version                      = (known after apply)
      ~ id                                     = "/subscriptions/971ddbb1-27d0-4cc7-a016-461dab5cec05/resourceGroups/studio-staging-rg/providers/Microsoft.Authorization/roleAssignments/e987caba-27a4-0061-4a9c-571549ede074" -> (known after apply)
      ~ name                                   = "e987caba-27a4-0061-4a9c-571549ede074" -> (known after apply)
      ~ principal_type                         = "ServicePrincipal" -> (known after apply)
      ~ role_definition_id                     = "/subscriptions/971ddbb1-27d0-4cc7-a016-461dab5cec05/providers/Microsoft.Authorization/roleDefinitions/43d0d8ad-25c7-4714-9337-8ba259a9fe05" -> "/subscriptions/1ce8e9af-c2d6-44e7-9c5e-099a308056fe/providers/Microsoft.Authorization/roleDefinitions/43d0d8ad-25c7-4714-9337-8ba259a9fe05" # forces replacement
      ~ role_definition_name                   = "Monitoring Reader" -> (known after apply)
        # (6 unchanged attributes hidden)
    }

  # helm_release.kube_prometheus_stack will be updated in-place
  ~ resource "helm_release" "kube_prometheus_stack" {
        id                         = "kube-prometheus-stack"
        name                       = "kube-prometheus-stack"
      ~ version                    = "69.3.1" -> "69.4.1"
        # (27 unchanged attributes hidden)
    }

Plan: 9 to add, 1 to change, 9 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan.out

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan.out"
Releasing state lock. This may take a few moments...

```

</details>

| Context | Values |
| - | - |
| Pusher | @renovate[bot] |
| Action | `pull_request` |
| Working Directory | `./infrastructure/adminservices-test/altinn-monitor-test-rg` |
| State File | `github.com/altinn/altinn-platform/environments/test/altinn-monitor-test-rg.tfstate` |
| Plan File | `github.com_altinn_altinn-platform_environments_test_altinn-monitor-test-rg.tfstate.tfplan`